using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading;
using System.Threading.Tasks;
using YuanTu.Consts;
using YuanTu.Consts.FrameworkBase;
using YuanTu.Core.Log;
using YuanTu.Core.Extension;

namespace YuanTu.BJArea.Services.BankPosBOC
{

    public interface IBankPosBOC : IService
    {
        string DoTransaction(string strIn);
        BankPosStr DoSale(decimal Amt, string TerminalNo, string UserId = "001");
        BankPosStr DoReverse();
        BankPosStr DoReverse(string TransSeq, decimal Amt, string TerminalNo, string UserId = "001");

    }
    public class BankPosBOCInterface : IBankPosBOC
    {
        public string ServiceName => "MisPos";
        public string FakeDirectory { get; set; } = Path.Combine(AppDomain.CurrentDomain.BaseDirectory, "FakeServer");

        private const string Prefix = "银行接口";
        private long _count;

        public const string PankPosDllPath = "C:\\bankpos\\bankpos.dll";
        [DllImport(PankPosDllPath, EntryPoint = "CreditTrans", CharSet = CharSet.Ansi)]
        public static extern int CreditTrans(string strIn, StringBuilder strOut);
        public string DoTransaction(string strIn)
        {

            var i = Interlocked.Increment(ref _count);
            if (FrameworkConst.VirtualThridPay)
            {
                #region
                string res="";
                Logger.POS.Info("调用接口(模拟) strin=" + strIn);
                string name = "Bank_" + strIn.Substring(20, 1);
                var file = Path.Combine(FakeDirectory, FrameworkConst.HospitalId, $"{name}.txt");
                if (!File.Exists(file))
                {
                    file = Path.Combine(FakeDirectory, $"{name}.txt");
                    if (!File.Exists(file))
                        res = $"004563510000000000123{ strIn.Substring(20, 1)}000000001234010400567800005600000120151010162812120000000068";
                }
                using (var sr = new StreamReader(file))
                {
                    res = sr.ReadToEnd();
                }
                Logger.POS.Info($"接口返回(模拟)  strout=" + res);
                Thread.Sleep(500);
                return res;
                #endregion
            }
            else
            {
                StringBuilder strOut = new StringBuilder(1024);
                Logger.POS.Info("调用接口 strin=" + strIn);
                int r = CreditTrans(strIn, strOut);
                Logger.POS.Info($"接口返回 ret={r.ToString()}  strout="+ strOut.ToString().TrimEnd());

                return strOut.ToString().TrimEnd();
            }
        }

        public BankPosStr DoSale(decimal Amt, string TerminalNo, string UserId = "001")
        {
            BankPosStr bpsS = new BankPosStr();
            bpsS.TerminalNo = TerminalNo;
            bpsS.UserId = UserId;
            bpsS.TransFlag = "C";
            bpsS.Amt = Amt;
            string ret = DoTransaction(bpsS.GetBankPosStr());
            BankPosStr bpsR = new BankPosStr(ret);
            bpsR.TerminalNo = TerminalNo;
            bpsR.UserId = UserId;
            //bpsR.SetBankPosStr(ret);
            lastStr = bpsR;
            return bpsR;
        }
        public static BankPosStr lastStr;
        public BankPosStr DoReverse()
        {
            return DoReverse(lastStr.TransSeq, lastStr.Amt, lastStr.TerminalNo, lastStr.UserId);
        }
        public BankPosStr DoReverse(string TransSeq, decimal Amt, string TerminalNo, string UserId = "001")
        {
            BankPosStr bpsS = new BankPosStr();
            bpsS.TransFlag = "H";
            string ret = DoTransaction(bpsS.GetBankPosStr());
            BankPosStr bpsR = new BankPosStr(ret);
            bpsR.TerminalNo = TerminalNo;
            bpsR.UserId = UserId;
            //bpsR.SetBankPosStr(ret);
            return bpsR;
        }
    }

    public class BankPosStr
    {
        public BankPosStr()
        { }
        public BankPosStr(string strOut)
        { //004563510000000000123C000000001234010400567800005600000120151010162812120000000068
            ResultCode = strOut.Substring(0, 2);
            if (ResultCode != "00")
            {//交易失败
                return;
            }
            BankNo = strOut.Substring(2, 19).TrimEnd(' ');
            TransFlag = strOut.Substring(21, 1);
            Amt = int.Parse(strOut.Substring(22, 12).TrimStart('0'));
            CardIssuingCode = strOut.Substring(34, 4);
            TransSeq = strOut.Substring(38, 6);
            POSSeq = strOut.Substring(44, 6);
            ClearDate = strOut.Substring(50, 6);
            TransDateTime = strOut.Substring(56, 14);
            CenterSeq = strOut.Substring(70, 12);
            ComNo = strOut.Substring(82, 15);
            TerminalNo = strOut.Substring(97, 8);
        }
        public static implicit operator bool(BankPosStr result)
        {
            return result.ResultCode=="00";
        }
        public string ComNo;
        public string TerminalNo;
        public string UserId;
        public string TransFlag;
        public decimal Amt = 0;

        public string ResultCode;
        public string ResultMsg
        {
            get
            {
                if (DirErrorMsg.ContainsKey(ResultCode))
                    return DirErrorMsg[ResultCode];
                else return "未知错误" + ResultCode;
            }
        }
        public string BankNo;//卡号
        public string CardIssuingCode;//发卡行
        public string CardIssuingName
        {
            get
            {
                if (DirBankName.ContainsKey(CardIssuingCode))
                    return DirBankName[CardIssuingCode];
                else return "未知银行" + CardIssuingCode;
            }
        }
        public string TransSeq;//交易凭证号
        public string POSSeq;//授权号
        public string ClearDate;//批次号
        public string TransDateTime;//日期时间
        public string CenterSeq;//参考号

        public string GetBankPosStr()
        {
            string str = "";
            str += TerminalNo.PadRight(10, ' ');
            str += UserId.PadRight(10, ' ');
            str += TransFlag;
            str += Amt.ToString().PadLeft(12, '0');
            //str += new string(' ', 33);
            if (TransFlag == "H")
            {
                str += TransSeq;
            }
            else if (TransFlag == "R")//退货，接口未提供交易类型标识，不实现
            {
                str += TransSeq;
                str += POSSeq;
                str += ClearDate;
                str += TransDateTime;
                str += CenterSeq;
            }
            return str;
        }
        //public bool SetBankPosStr(string strOut)
        //{
        //    return true;
        //}

        public static Dictionary<string, string> DirErrorMsg = new Dictionary<string, string> {
            {"00","交易成功"},
            {"01","请与银行联系"},
            {"03","无效商户"},
            {"05","不批准交易  "},
            {"08","请与银行联系"},
            {"12","无效交易"},
            {"13","无效金额"},
            {"14","无效卡号"},
            {"15","无此发卡行  "},
            {"19","请重做交易  "},
            {"21","不做任何处理"},
            {"25","无此交易"},
            {"26","重复交易"},
            {"28","交易无法处理"},
            {"29","拒绝更新文件"},
            {"30","格式错误"},
            {"33","过期卡  "},
            {"34","有作弊嫌疑(没收卡)  "},
            {"35","联系保安(没收卡)"},
            {"37","联系卡中心(没收卡)  "},
            {"38","PIN输入超次(没收卡) "},
            {"39","无此账户"},
            {"40","非法功能"},
            {"41","挂失卡(没收卡)  "},
            {"43","被窃卡(没收卡)"},
            {"45","请插IC卡交易"},
            {"51","余额不足"},
            {"54","过期卡  "},
            {"55","密码错  "},
            {"56","无此卡记录  "},
            {"57","非法交易"},
            {"59","有作弊嫌疑  "},
            {"60","请与银行联系"},
            {"61","超出取款限额"},
            {"62","受限制卡"},
            {"63","违反安全保密规定"},
            {"64","无效原金额  "},
            {"65","取款次数超过次数"},
            {"67","没收卡  "},
            {"75","PIN输入超过次数 "},
            {"77","结算不平"},
            {"78","止付卡  "},
            {"79","非法帐户"},
            {"80","交易拒绝"},
            {"81","卡已作废"},
            {"84","联网暂断,重做交易   "},
            {"87","PIN密钥同步错   "},
            {"88","MAC密钥同步错   "},
            {"90","主机轧帐稍候工作"},
            {"91","交易超时"},
            {"92","重做交易或电话授权  "},
            {"94","重复交易"},
            {"95","结算不平,上送交易   "},
            {"96","系统异常"},
            {"97","终端号错误  "},
            {"98","暂与发卡行失去联络  "},
            {"99","PIN格式错   "},
            {"A0","校验错，请重新签到  "},
            {"AA","数据非法"},
            {"BB","卡种非法"},
            {"CC","签到拒绝"},
            {"CN","连接失败"},
            {"DD","对帐不平"},
            {"EE","对帐稍候"},
            {"EF","上批次对帐错误  "},
            {"FF","异常错误"},
            {"GG","串口出错"},
            {"HH","冲正中.."},
            {"II","交易有效"},
            {"JJ","交易无效"},
            {"KK","交易取消"},
            {"LL","已结帐  "},
            {"MM","卡号不符"},
            {"N0","不匹配的交易"},
            {"N1","不匹配的交易"},
            {"NN","金额不符"},
            {"OO","无此交易"},
            {"P0","只接受借记卡的付款  "},
            {"P1","暂不接受此类卡的付款"},
            {"P2","暂不接受此类卡的付款"},
            {"P3","不正确的商户卡  "},
            {"P4","未绑定的商户卡  "},
            {"P5","商户卡对应关系错"},
            {"PP","系统忙  "},
            {"Q2","有效期错"},
            {"SE","系统故障"},
            {"SK","无效卡校验  "},
            {"SW","网络超时"},
            {"Z1","请先签到"},
            {"Z2","积分不够"},
            {"Z3","分期期数错  "},
            {"Z4","分期计划错  "},
            {"Z5","请联系收单行手工退货"},
            {"Z6","无效交易币种"},
            {"Z7","上批未结，请先结上批"},
            {"Z8","不支持该卡种"},
            {"ZD","请结帐后再做交易" },
        };
        public static Dictionary<string, string> DirBankName = new Dictionary<string, string> {
            {"0000","中国银联"},
            {"0001","中国银联"},
            {"0008","银联ATMP系统"},
            {"0009","银联POSP系统"},
            {"0016","银联公共支付平台"},
            {"0100","邮政储汇总局"},
            {"0102","中国工商总行"},
            {"0103","中国农业总行"},
            {"0104","中国银行总行"},
            {"0105","中国建设总行"},
            {"0301","交通银行总行"},
            {"0302","中信银行总行"},
            {"0303","中国光大总行"},
            {"0304","华夏银行"},
            {"0305","中国民生总行"},
            {"0306","广东发展总行"},
            {"0307","深圳发展总行"},
            {"0308","招商银行总行"},
            {"0309","兴业银行总行"},
            {"0310","上海浦发总行"},
            {"0311","恒丰银行总行"},
            {"0313","天津市商业银行"},
            {"0316","浙商银行总行"},
            {"0317","渤海银行"},
            {"0319","花旗银行(中国)有限公司"},
            {"0320","东亚银行中国有限公司"},
            {"0321","汇丰银(中国)有限公司"},
            {"0322","渣打银行中国有限公司"},
            {"0324","星展银行"},
            {"0326","恒生银行"},
            {"0327","友利银行(中国)有限公司"},
            {"0328","新韩银行"},
            {"0329","韩亚银行（中国）"},
            {"0330","华侨银行（中国）"},
            {"0331","永亨银行（中国）有限公司"},
            {"0332","南洋商业银行（中国）"},
            {"0333","法国兴业银行（中国）"},
            {"0334","大华银行（中国）"},
            {"0335","大新银行（中国）"},
            {"0401","上海银行"},
            {"0402","厦门商业银行"},
            {"0403","北京银行"},
            {"0404","烟台商业银行"},
            {"0405","福州商业银行"},
            {"0406","长春商业银行"},
            {"0407","镇江商业银行"},
            {"0408","宁波商业银行"},
            {"0409","济南商业银行"},
            {"0410","深圳商业银行"},
            {"0411","焦作商业银行"},
            {"0412","温州商业银行"},
            {"0413","广州商业银行"},
            {"0414","武汉商业银行"},
            {"0416","齐齐哈尔商业银行"},
            {"0417","沈阳商业银行"},
            {"0418","洛阳商业银行"},
            {"0419","辽阳商业银行"},
            {"0420","大连商业银行"},
            {"0421","苏州商业银行"},
            {"0422","石家庄商业银行"},
            {"0423","杭州商业银行"},
            {"0424","南京商业银行"},
            {"0425","东莞商业银行"},
            {"0426","金华商业银行"},
            {"0427","乌鲁木齐商业银行"},
            {"0428","绍兴商业银行"},
            {"0429","成都商业银行"},
            {"0430","抚顺商业银行"},
            {"0431","临沂商业银行"},
            {"0432","宜昌商业银行"},
            {"0433","葫芦岛商业银行"},
            {"0434","天津市商业银行"},
            {"0435","郑州市商业银行"},
            {"0436","银川市商业银行"},
            {"0437","珠海市商业银行"},
            {"0438","淄博市商业银行"},
            {"0439","锦州市商业银行"},
            {"0440","合肥市商业银行"},
            {"0441","重庆市商业银行"},
            {"0442","哈尔滨市商业银行"},
            {"0443","贵阳市商业银行"},
            {"0444","西安市商业银行"},
            {"0445","无锡市商业银行"},
            {"0446","丹东市商业银行"},
            {"0447","兰州市商业银行"},
            {"0448","南昌市商业银行"},
            {"0449","太原市商业银行"},
            {"0450","青岛市商业银行"},
            {"0451","吉林市商业银行"},
            {"0452","南通市商业银行"},
            {"0453","扬州市商业银行"},
            {"0454","九江市商业银行"},
            {"0455","日照市商业银行"},
            {"0456","鞍山市商业银行"},
            {"0457","秦皇岛商业银行"},
            {"0458","西宁市商业银行"},
            {"0459","台州市商业银行"},
            {"0460","盐城市商业银行"},
            {"0461","长沙市商业银行"},
            {"0462","潍坊市商业银行"},
            {"0463","赣州市商业银行"},
            {"0464","泉州市商业银行"},
            {"0465","营口市商业银行"},
            {"0466","昆明市商业银行"},
            {"0467","阜新市商业银行"},
            {"0468","常州市商业银行"},
            {"0469","淮安市商业银行"},
            {"0470","嘉兴市商业银行"},
            {"0471","芜湖市商业银行"},
            {"0472","廊坊市商业银行"},
            {"0473","台州市泰隆城信用社"},
            {"0474","呼和浩特城市商业银行"},
            {"0475","湖州市商业银行"},
            {"0476","沧州银行股份有限公司"},
            {"0477","马鞍山商业银行"},
            {"0478","南宁商业银行"},
            {"0479","包头商业银行"},
            {"0480","连云港商业银行"},
            {"0481","威海商业银行"},
            {"0482","淮北商业银行"},
            {"0483","攀枝花商业银行"},
            {"0484","安庆商业银行"},
            {"0485","绵阳商业银行"},
            {"0486","泸州商业银行"},
            {"0487","大同商业银行"},
            {"0488","三门峡城市信用社"},
            {"0489","湛江市商业银行"},
            {"0490","张家口商业银行"},
            {"0491","桂林市商业银行"},
            {"0492","大庆市商业银行"},
            {"0493","靖江市长江城市信用社"},
            {"0494","徐州市商业银行"},
            {"0495","柳州市商业银行"},
            {"0496","南充市商业银行"},
            {"0497","莱芜银行"},
            {"0498","德阳市商业银行"},
            {"0499","唐山市商业银行"},
            {"0500","六盘水商行"},
            {"0502","曲靖市商业银行"},
            {"0503","晋城商业银行"},
            {"0505","东莞商行"},
            {"0506","温州银行"},
            {"0507","汉口银行"},
            {"0508","江苏银行"},
            {"0510","平安银行股份有限公司"},
            {"0512","长治市商业银行"},
            {"0513","承德市商业银行"},
            {"0515","德州市商业银行"},
            {"0516","遵义市商业银行"},
            {"0517","邯郸市商业银行"},
            {"0518","运城市农村信用合作社联合社"},
            {"0519","安顺市商业银行"},
            {"0521","江苏银行"},
            {"0523","平凉市商业银行"},
            {"0524","玉溪市商业银行"},
            {"0525","浙江民泰商业银行"},
            {"0526","上饶市商业银行"},
            {"0527","东营市商业银行"},
            {"0528","泰安市商业银行"},
            {"0529","襄樊市商业银行股份有限公司"},
            {"0530","浙江稠州商业银行"},
            {"0531","乌海市商业银行"},
            {"0532","自贡市商业银行"},
            {"0533","龙江银行股份有限公司"},
            {"0534","鄂尔多斯市商业银行股份有限公司"},
            {"0535","鹤壁市城市信用社股份有限公司"},
            {"0536","许昌市商业银行"},
            {"0537","济宁银行股份有限公司"},
            {"0539","铁岭市商业银行股份有限公司"},
            {"0540","乐山市商业银行"},
            {"0541","宝鸡商行"},
            {"0542","重庆三峡银行"},
            {"0543","石嘴山银行"},
            {"0544","盘锦市商业银行"},
            {"0547","克拉玛依市商业银行"},
            {"0548","平顶山市商业银行"},
            {"0549","朝阳市商业银行"},
            {"0550","象山县绿叶城市信用社"},
            {"0551","遂宁市商业银行"},
            {"0552","保定市商业银行"},
            {"0553","黄石银行"},
            {"0554","邢台市商业银行"},
            {"0555","凉山州商业银行"},
            {"0556","漯河商行"},
            {"0557","达州市商业银行"},
            {"0558","新乡市商业银行"},
            {"0559","晋中市商业银行"},
            {"0560","驻马店市商业银行"},
            {"0561","衡水市商业银行"},
            {"0562","周口市商业银行"},
            {"0563","阳泉市商业银行"},
            {"0564","宜宾市商业银行"},
            {"0565","库尔勒市商业银行"},
            {"0566","雅安市商业银行"},
            {"0567","商丘商行"},
            {"0568","安阳市商业银行"},
            {"0569","信阳银行"},
            {"0570","华融湘江银行"},
            {"0573","景德镇商业银行"},
            {"0575","湖北银行"},
            {"0577","新疆汇和银行"},
            {"0578","广东华兴银行"},
            {"0610","平安银行股份有限公司"},
            {"0804","盛京银行"},
            {"0901","VISA"},
            {"0902","MASTER"},
            {"0903","JCB"},
            {"0904","DINNER"},
            {"0905","AE"},
            {"1401","上海市农信社"},
            {"1402","昆山市农信社"},
            {"1403","常熟市农商银行"},
            {"1404","深圳市农信社"},
            {"1405","广州市农信社"},
            {"1406","杭州市萧山区农信社"},
            {"1407","南海市农信社"},
            {"1408","顺德市农信社"},
            {"1409","昆明市农信社"},
            {"1410","武汉农信社"},
            {"1411","徐州农信社"},
            {"1412","江阴农商行"},
            {"1413","重庆农信社"},
            {"1414","山东农信社"},
            {"1415","东莞农信社"},
            {"1416","张家港农商行"},
            {"1417","厦门农信社"},
            {"1418","北京农信社"},
            {"1419","天津农信社"},
            {"1420","宁波鄞州农合行"},
            {"1421","佛山三水区农信社"},
            {"1422","成都市农信社"},
            {"1423","沧州市农信社"},
            {"1424","江苏省农信社"},
            {"1425","江门市新会农信社"},
            {"1426","高要市农信社"},
            {"1427","佛山市禅城区农信社"},
            {"1428","江苏吴江农商行"},
            {"1429","浙江农信社"},
            {"1430","江苏东吴农商行"},
            {"1431","珠海农信社"},
            {"1432","中山农信社"},
            {"1433","江苏太仓农商行公司"},
            {"1434","临汾市尧都区信合社"},
            {"1435","江苏武进农商行公司"},
            {"1436","贵州省农信社"},
            {"1437","江苏锡州农商公司"},
            {"1438","湖南省农村信用社联合社"},
            {"1439","江西农信联合社"},
            {"1440","河南省农村信用社联合社"},
            {"1441","河北省农村信用社联合社"},
            {"1442","陕西省农村信用社联合社"},
            {"1443","广西农村信用社联合社"},
            {"1444","新疆维吾尔自治区农村信用社联合"},
            {"1445","吉林农信联合社"},
            {"1446","黄河农村商业银行"},
            {"1447","安徽省农村信用社联合社"},
            {"1448","海南省农村信用社联合社"},
            {"1449","青海省农村信用社联合社"},
            {"1450","广东省农村信用社联合社"},
            {"1451","内蒙古自治区农村信用社联合式"},
            {"1452","四川省农村信用社联合社"},
            {"1453","甘肃省农村信用社联合社"},
            {"1454","辽宁省农村信用社联合社"},
            {"1455","山西省农村信用社"},
            {"1456","天津滨海农村商业银行"},
            {"1457","黑龙江省农村信用社联合社"},
            {"1459","武汉农村商业银行"},
            {"1460","江南农村商业银行"},
            {"1500","大邑交银兴民村镇银行"},
            {"1501","湖北嘉鱼吴江村镇银行"},
            {"1502","青岛即墨北农商村镇银行"},
            {"1503","双流诚民村镇银行"},
            {"1504","福建建瓯石狮村镇银行"},
            {"1505","恩施常农商村镇银行"},
            {"1508","浙江长兴联合村镇银行"},
            {"1510","重庆璧山工银村镇银行"},
            {"1511","村镇银行"},
            {"1512","江苏沭阳东吴村镇银行"},
            {"1513","重庆农村商业银行"},
            {"1514","村镇银行"},
            {"1515","中山小榄村镇银行"},
            {"1517","江苏邗江民泰村镇银行"},
            {"1518","安徽当涂新华村镇银行"},
            {"1519","村镇银行"},
            {"1520","村镇银行"},
            {"1521","村镇银行"},
            {"1526","南阳村镇银行"},
            {"2500","渣打银行"},
            {"2501","香港上海汇丰银行有限公司"},
            {"2502","东亚银行有限公司"},
            {"2503","花旗银行香港分行"},
            {"2504","大新银行有限公司"},
            {"2505","恒生银行有限公司"},
            {"2506","永亨银行有限公司"},
            {"2507","美国银行（亚洲）有限公司"},
            {"2508","星展银行（香港）有限公司"},
            {"2509","上海商业银行"},
            {"2510","永隆银行有限公司"},
            {"2511","港基国际银行有限公司"},
            {"2512","香港上海汇丰银行有限公司"},
            {"2513","香港上海汇丰银行有限公司"},
            {"2514","恒生银行有限公司发卡系统"},
            {"2515","恒生银行有限公司"},
            {"2516","中信嘉华银行有限公司"},
            {"2517","廖创兴银行有限公司"},
            {"2518","中银信用卡（国际）有限公司贷记卡发卡系统"},
            {"2519","中国银行（香港）有限公司借记卡发卡系统"},
            {"2520","南洋商业银行借记卡发卡系统"},
            {"2521","集友银行借记卡发卡系统"},
            {"2522","易办事（香港）有限公司"},
            {"2523","AEON 信贷财务（亚洲）有限公司"},
            {"2524","中国工商银行（亚洲）有限公司"},
            {"2525","大丰银行有限公司"},
            {"2526","AEON信贷财务亚洲有限公司"},
            {"2527","中国建设银行澳门股份有限公司"},
            {"2528","渣打银行香港有限公司"},
            {"2529","中国银盛"},
            {"2600","韩国BC卡公司"},
            {"2601","奥思知集团（泰国）有限公司"},
            {"2602","新加坡NETS 有限公司"},
            {"2603","泰国泰华农民银行"},
            {"2604","通济隆全球及金融服务有限公司"},
            {"2605","PCC 公司（泰国）"},
            {"2607","大华银行"},
            {"2608","澳门永亨银行股份有限公司"},
            {"2609","PT Indonesia Union Pay （印度尼西亚）"},
            {"2610","Bancnet 公司（菲律宾）"},
            {"2611","三井住友卡公司（日本）"},
            {"2612","欧洲储蓄银行金融服务公司"},
            {"2613","B+S Card Service GmbH（德国）"},
            {"2614","发现卡公司（美国）"},
            {"2615","东亚商业银行（越南）"},
            {"2616","西贡工贸银行（越南）"},
            {"2622","澳门国际银行"},
            {"2623","大西洋银行股份有限公司"},
            {"2629","Discover Financial Services"},
            {"2632","澳门商业银行"},
            {"2633","哈萨克斯坦国民储蓄银行"},
            {"2635","Bangkok Bank Pcl"},
            {"2647","中国工商银行（澳门）"},
            {"2653","可汗银行"},
            {"2662","蒙古郭勒姆特银行"},
            {"2663","BC卡公司"},
            {"2669","莫斯科人民储蓄银行"},
            {"2670","丝绸之路银行"},
            {"2678","俄罗斯远东商业银行"},
            {"2679","CSC"},
            {"2693","Allied Bank"},
            {"2709","日本三菱信用卡公司"},
            {"2713","Baiduri Bank Berhad"},
            {"2720","越南西贡商业银行"},
            {"2724","菲律宾BDO"},
            {"2725","菲律宾RCBC"},
            {"2752","新加坡星网电子付款私人有限公司"},
            {"2755","Royal Bank Open Stock Company"},
            {"2771","BCEL"},
            {"2802","澳门通股份有限公司"},
            {"2803","韩国乐天"},
            {"4798","中国银行(香港)"},
            {"4808","中国银行"},
            {"4810","中银通商务支付有限公司"},
            {"6100","中国邮政储蓄银行信用卡中心"},
            {"6302","中信银行信用卡中心"},
            {"6303","光大银行"},
            {"6304","华夏银行"},
            {"6310","浦发银行信用卡中心"},
            {"6320","东亚银行(中国)有限公司"},
            {"6403","北京银行"},
            {"6408","宁波银行"},
            {"6409","齐鲁银行"},
            {"6413","广州市商业银行"},
            {"6416","龙江银行股份有限公司"},
            {"6422","石家庄商行"},
            {"6423","杭州市商业银行"},
            {"6429","成都市商业银行"},
            {"6431","临商银行"},
            {"6438","齐商银行"},
            {"6439","锦州银行"},
            {"6440","徽商银行"},
            {"6441","重庆银行股份有限公司"},
            {"6442","哈尔滨商行"},
            {"6443","贵阳市商业商行"},
            {"6447","兰州银行"},
            {"6448","南昌银行"},
            {"6450","青岛银行"},
            {"6454","九江银行股份有限公司"},
            {"6455","日照银行"},
            {"6458","青海银行"},
            {"6462","潍坊银行"},
            {"6463","赣州银行股份有限公司"},
            {"6466","富滇银行"},
            {"6473","浙江泰隆商业银行"},
            {"6474","内蒙古银行"},
            {"6475","湖州银行"},
            {"6478","广西北部湾银行"},
            {"6481","威海市商业银行"},
            {"6489","广东南粤银行股份有限公司"},
            {"6491","桂林银行"},
            {"6492","龙江银行股份有限公司"},
            {"6501","上海农村商业银行"},
            {"6505","广州农村商业银行"},
            {"6508","佛山顺德农村商业银行"},
            {"6509","云南省农村信用社"},
            {"6513","承德银行"},
            {"6515","德州市商业银行"},
            {"6517","福建省农村信用社联合社"},
            {"6519","天津农村合作银行"},
            {"6522","成都市农村信用合作社联合社"},
            {"6524","江苏省农村信用社联合社"},
            {"6526","上饶银行"},
            {"6527","东营市商业银行"},
            {"6534","临汾市尧都区农村信用合作联社"},
            {"6537","江苏锡州农村商业银行"},
            {"6538","湖南农村信用社联合社"},
            {"6547","安徽省农村信用社"},
            {"6554","邢台银行"},
            {"6567","商丘市商业银行"},
        };
    }

}
