using System;
using System.Collections.Generic;

namespace YuanTu.ShengZhouZhongYiHospital.ISO8583
{
    static class StatusCode
    {
        #region RetDic

        private static Dictionary<int, string> RetDic = new Dictionary<int, string>
		{
			{0, "承兑或交易成功"},
			{1, "查发卡行"},
			{2, "查发卡行的特殊条件"},
			{3, "无效商户"},
			{4, "没收卡"},
			{5, "不予承兑"},
			{6, "出错"},
			{7, "特殊条件下没收卡"},
			{9, "请求正在处理中"},
			{12, "无效交易"},
			{13, "无效金额"},
			{14, "无效卡号"},
			{15, "无此发卡行"},
			{19, "重新送入交易"},
			{20, "无效应答"},
			{21, "不做任何处理"},
			{22, "怀疑操作有误"},
			{23, "不可接受的交易费"},
			{25, "未能找到文件上记录"},
			{30, "格式错误"},
			{31, "银联不支持的银行"},
			{33, "过期的卡"},
			{34, "有作弊嫌疑"},
			{35, "受卡方与安全保密部门联系"},
			{36, "受限制的卡"},
			{37, "受卡方呼受理方安全保密部门(没收卡)"},
			{38, "超过允许的PIN试输入"},
			{39, "无此信用卡帐户"},
			{40, "请求的功能尚不支持"},
			{41, "丢失卡"},
			{42, "无此帐户"},
			{43, "被窃卡"},
			{44, "无此投资帐户"},
			{45, "请使用芯片"},
			{51, "无足够的存款"},
			{52, "无此支票账户"},
			{53, "无此储蓄卡账户"},
			{54, "过期的卡"},
			{55, "密码错误"},
			{56, "无此卡记录"},
			{57, "不允许持卡人进行的交易"},
			{58, "不允许终端进行的交易"},
			{59, "有作弊嫌疑"},
			{60, "受卡方与安全保密部门联系"},
			{61, "超出取款金额限制"},
			{62, "受限制的卡"},
			{63, "违反安全保密规定"},
			{64, "原始金额不正确"},
			{65, "超出取款次数限制"},
			{66, "受卡方呼受理方安全保密部门"},
			{67, "捕捉（没收卡）"},
			{68, "收到的回答太迟"},
			{75, "允许的输入PIN次数超限"},
			{77, "需要向网络中心签到"},
			{79, "脱机交易对帐不平"},
            {81, "MAC校验错"},
            {90, "日期切换正在处理"},
			{91, "发卡行或银联不能操作"},
			{92, "金融机构或中间网络设施找不到或无法达到"},
			{93, "交易违法、不能完成"},
			{94, "重复交易"},
			{95, "调节控制错"},
			{96, "系统异常、失效"},
			{97, "POS终端号找不到"},
			{98, "银联收不到发卡行应答"},
			{99, "PIN格式错"},
			{0xA0, "MAC校验错"},
		};
        #endregion

        public static string Get(string status)
        {
            try
            {
                return RetDic[Convert.ToInt32(status)];
            }
            catch (Exception)
            {
                return "";
            }
        }
        public static string Get(int status)
        {
            try
            {
                return RetDic[status];
            }
            catch (Exception)
            {
                return "";
            }
        }
    }
}
